import numpy as np
from sklearn.metrics import precision_score, recall_score, f1_score

# # 工程风险
# observed = [
#     ["前杨桥左岸", "前杨桥左岸", "前杨桥左岸", "前杨桥左岸", "前杨桥左岸"],
#     ["上游150m处", "上游150m处", "上游150m处", "上游150m处", "上游150m"],
#     ["横向排水沟", "横向排水沟", "横向排水沟", "横向排水沟", "横向排水沟"],
#     ["有土半堵", "有土半堵", "土半堵", "有土半堵", "有土半堵"],
#     ["前杨村公路桥左岸", "前杨桥左岸", "前杨桥左岸", "前杨村公路桥左岸", "前杨桥左岸"],
#     ["上游100米处", "上游100米处", "上游150m处", "上游100米处", "上游150m处"],
#     ["横向排水沟排水沟", "横向排水沟", "横向排水沟", "横向排水沟", "横向排水沟"],
#     ["泥土太多", "泥土过多", "泥土太多", "泥土太多", "泥土"],
#     ["前杨村公路桥", "前杨村公路桥左岸", "前杨村公路桥左岸", "前杨村公路桥左岸", "前杨桥左岸"],
#     ["上游200米处", "上游200米处", "上游150m处", "上游200米处", "上游200米处"],
#     ["沉砌板", "沉砌板", "沉砌板", "沉砌板", "沉砌"],
#     ["裂缝", "裂缝", "裂缝", "裂缝", "裂缝"],
#     ["前杨村公路桥", "前杨村公路桥", "前杨村公路桥左岸", "前杨村公路桥", "前杨村公路左岸"],
#     ["上游200米处", "上游200米处", "上游150m处", "上游200米处", "上游200米"],
#     ["堤顶", "堤顶", "堤顶", "堤顶", "沉砌"],
#     ["裂缝", "裂缝", "裂缝", "裂缝", "裂缝"]
# ]
# 自然风险
# observed = [
#     ["耿家庄西北桥右岸", "耿家庄西北桥右岸", "耿家庄西北桥右岸", "耿家庄"],
#     ["上游桩号550处", "上游桩号550处", "上游桩号550处", "耿家庄西北桥右岸"],
#     ["杂草", "杂草", "杂草", "杂草"],
#     ["前杨桥左岸", "前杨桥左岸", "前杨桥左岸", "前杨桥左岸"],
#     ["上游150m处", "前杨桥左岸", "上游150m处", "前杨桥左岸"],
#     ["横向排水沟", "横向排水沟", "横向排水沟", "横向排水沟"],
#     ["有土半堵", "有土半堵", "有土半堵", "有土半堵"],
#     ["前杨村公路桥左岸", "前杨村公路桥左岸", "前杨村公路桥左岸", "前杨村公路桥左岸"],
#     ["上游100米处", "上游100米处", "前杨村公路桥左岸", "前杨村公路桥左岸"],
#     ["水沟排水沟", "横向排水沟", "横向排水沟口", "横向排水沟"],
#     ["泥土太多", "泥土太多", "泥土太多", "泥土太多"],
#     ["前杨村公路桥左岸", "前杨村公路桥左岸", "前杨村公路桥左岸", "前杨村公路桥左岸"],
#     ["下游80米处", "下游80米处", "前杨村公路桥左岸下游80米处", "前杨村公路桥左岸下游"],
#     ["横向排水沟", "横向排水沟", "横向排水沟", "横向排水沟口"],
#     ["泥土太多", "泥土太多", "垃圾泥土太多", "垃圾泥土太多"]
# ]

# 管理风险
observed = [
    ["魏庄河进口园区", "魏庄河", "魏庄河", "魏庄河进口园区"],
    ["有建筑垃圾", "有建筑垃圾", "有建筑垃圾", "有建筑垃圾"],
    ["玉女观西桥右岸", "玉女观西桥", "玉女观西桥右岸", "玉女观西桥右岸"],
    ["排水沟", "排水沟", "排水沟", "排水沟"],
    ["贾家村南桥右岸", "贾家村南桥", "贾家村南桥", "贾家村南桥右岸"],
    ["排水沟", "排水沟", "排水沟", "排水沟"],
    ["排水沟内有垃圾", "有垃圾", "有垃圾", "排水沟内有垃圾"],
    ["下游60米", "老张庄渡槽出口右岸", "老张庄渡槽出口右岸", "老张庄渡槽出口右岸"],
    ["排水沟内有垃圾", "有垃圾", "有垃圾", "排水沟内有垃圾"],
    ["三里屯分水口", "三里屯分水口", "三里屯分水口", "魏庄河"],
    ["一级马道", "三里屯分水口", "三里屯分水口一级马道", "三里屯分水口"],
    ["施工垃圾", "施工垃圾", "施工垃圾", "施工垃圾"],
    ["下庄西北生产桥右岸", "下庄西北生产桥", "下庄西北生产桥右岸", "下庄西北生产桥右岸"],
    ["桥头三角区", "下庄西北生产桥右岸", "桥头三角区", "桥头三角区"],
    ["横向排水沟", "横向排水沟", "横向排水沟", "横向排水沟"],
    ["垃圾未清理", "垃圾未清理", "垃圾未清理", "垃圾未清理"]
]

# 人为风险
observed = [
    ["淇滨大道桥下左岸", "淇滨大道桥", "淇滨大道桥下左岸", "淇滨大道桥下左岸"],
    ["施工人员", "施工人员", "施工人员", "建筑物"],
    ["未穿反光马甲", "未穿反光马甲", "未穿反光马甲", "未穿反光马甲"],
    ["淇河节制闸", "园区责任人牌", "园区责任人牌", "魏庄河"],
    ["无园区责任人牌", "无", "无", "无园区责任人牌"],
    ["柴油发电机室", "柴油发电机室", "柴油发电机室", "魏庄河"],
    ["负责人与实际不符", "负责人与实际不符", "负责人与实际不符", "负责人与实际不符"],
    ["三里屯闸室", "三里屯闸室", "三里屯闸室", "三里屯闸室"],
    ["一楼", "三里屯闸室一楼", "一楼", "三里屯闸室"],
    ["责任人牌丢失", "丢失", "丢失", "责任人牌丢失"]
]
observed = np.array(observed)

# 初始化存储结果的列表
accuracy_scores = []
recall_scores = []
f1_scores = []
one_list = observed[:, 0]
# 计算每一列的准确率、召回率和F1分数
len_dta = len(observed[0])
for col in range(1, len_dta):
    acc = precision_score(observed[:, 0], observed[:, col], average='weighted')
    rec = recall_score(observed[:, 0], observed[:, col], average='weighted')
    f1 = f1_score(observed[:, 0], observed[:, col], average='weighted')
    print(acc, rec, f1)
